# Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

title_1 = [1, 2, 'one', 'two', True, 3.14]
for i in title_1:
    print(type(i))
